<?xml version="1.0" ?>
<net name="ResMobNet_v4 (LReLU) with single SSD head" version="11">
	<layers>
		<layer id="24" name="data" type="Parameter" version="opset1">
			<data element_type="f32" shape="1,3,320,544"/>
			<rt_info>
				<attribute name="fused_names" value="data" version="0"/>
				<attribute name="old_api_map_element_type" value="f16" version="0"/>
			</rt_info>
			<output>
				<port id="0" names="data" precision="FP32">
					<dim>1</dim>
					<dim>3</dim>
					<dim>320</dim>
					<dim>544</dim>
					<rt_info>
						<attribute layout="[N,C,H,W]" name="layout" version="0"/>
					</rt_info>
				</port>
			</output>
		</layer>
		<layer id="0" name="3657366126076" type="Const" version="opset1">
			<data element_type="f32" offset="0" shape="" size="4"/>
			<output>
				<port id="0" precision="FP32"/>
			</output>
		</layer>
		<layer id="1" name="3658366226802" type="Const" version="opset1">
			<data element_type="f32" offset="4" shape="" size="4"/>
			<output>
				<port id="0" precision="FP32"/>
			</output>
		</layer>
		<layer id="2" name="3659366326142" type="Const" version="opset1">
			<data element_type="f32" offset="0" shape="" size="4"/>
			<output>
				<port id="0" precision="FP32"/>
			</output>
		</layer>
		<layer id="3" name="3660366425554" type="Const" version="opset1">
			<data element_type="f32" offset="4" shape="" size="4"/>
			<output>
				<port id="0" precision="FP32"/>
			</output>
		</layer>
		<layer id="4" name="5217522125617" type="Const" version="opset1">
			<data element_type="f32" offset="8" shape="" size="4"/>
			<output>
				<port id="0" precision="FP32"/>
			</output>
		</layer>
		<layer id="5" name="5218522225671" type="Const" version="opset1">
			<data element_type="f32" offset="12" shape="" size="4"/>
			<output>
				<port id="0" precision="FP32"/>
			</output>
		</layer>
		<layer id="6" name="5219522326493" type="Const" version="opset1">
			<data element_type="f32" offset="8" shape="" size="4"/>
			<output>
				<port id="0" precision="FP32"/>
			</output>
		</layer>
		<layer id="7" name="5220522427315" type="Const" version="opset1">
			<data element_type="f32" offset="12" shape="" size="4"/>
			<output>
				<port id="0" precision="FP32"/>
			</output>
		</layer>
		<layer id="8" name="5297530126115" type="Const" version="opset1">
			<data element_type="f32" offset="16" shape="" size="4"/>
			<output>
				<port id="0" precision="FP32"/>
			</output>
		</layer>
		<layer id="9" name="5298530225371" type="Const" version="opset1">
			<data element_type="f32" offset="20" shape="" size="4"/>
			<output>
				<port id="0" precision="FP32"/>
			</output>
		</layer>
		<layer id="10" name="5299530327369" type="Const" version="opset1">
			<data element_type="f32" offset="16" shape="" size="4"/>
			<output>
				<port id="0" precision="FP32"/>
			</output>
		</layer>
		<layer id="11" name="5300530424663" type="Const" version="opset1">
			<data element_type="f32" offset="20" shape="" size="4"/>
			<output>
				<port id="0" precision="FP32"/>
			</output>
		</layer>
		<layer id="12" name="4177418127057" type="Const" version="opset1">
			<data element_type="f32" offset="24" shape="" size="4"/>
			<output>
				<port id="0" precision="FP32"/>
			</output>
		</layer>
		<layer id="13" name="4178418227321" type="Const" version="opset1">
			<data element_type="f32" offset="28" shape="" size="4"/>
			<output>
				<port id="0" precision="FP32"/>
			</output>
		</layer>
		<layer id="14" name="4179418326376" type="Const" version="opset1">
			<data element_type="f32" offset="24" shape="" size="4"/>
			<output>
				<port id="0" precision="FP32"/>
			</output>
		</layer>
		<layer id="15" name="4180418425446" type="Const" version="opset1">
			<data element_type="f32" offset="28" shape="" size="4"/>
			<output>
				<port id="0" precision="FP32"/>
			</output>
		</layer>
		<layer id="16" name="5817582125503" type="Const" version="opset1">
			<data element_type="f32" offset="32" shape="" size="4"/>
			<output>
				<port id="0" precision="FP32"/>
			</output>
		</layer>
		<layer id="17" name="5818582226322" type="Const" version="opset1">
			<data element_type="f32" offset="36" shape="" size="4"/>
			<output>
				<port id="0" precision="FP32"/>
			</output>
		</layer>
		<layer id="18" name="5819582325365" type="Const" version="opset1">
			<data element_type="f32" offset="32" shape="" size="4"/>
			<output>
				<port id="0" precision="FP32"/>
			</output>
		</layer>
		<layer id="19" name="5820582427906" type="Const" version="opset1">
			<data element_type="f32" offset="36" shape="" size="4"/>
			<output>
				<port id="0" precision="FP32"/>
			</output>
		</layer>
		<layer id="20" name="3677368124822" type="Const" version="opset1">
			<data element_type="f32" offset="40" shape="" size="4"/>
			<output>
				<port id="0" precision="FP32"/>
			</output>
		</layer>
		<layer id="21" name="3678368226736" type="Const" version="opset1">
			<data element_type="f32" offset="44" shape="" size="4"/>
			<output>
				<port id="0" precision="FP32"/>
			</output>
		</layer>
		<layer id="22" name="3679368325701" type="Const" version="opset1">
			<data element_type="f32" offset="40" shape="" size="4"/>
			<output>
				<port id="0" precision="FP32"/>
			</output>
		</layer>
		<layer id="23" name="3680368427984" type="Const" version="opset1">
			<data element_type="f32" offset="44" shape="" size="4"/>
			<output>
				<port id="0" precision="FP32"/>
			</output>
		</layer>
		<layer id="25" name="data_mul_24444108626511" type="Const" version="opset1">
			<data element_type="f16" offset="48" shape="1,3,1,1" size="6"/>
			<output>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>3</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="26" name="data_mul_24444108613917/restored_convert" type="Convert" version="opset1">
			<data destination_type="f32"/>
			<rt_info>
				<attribute name="decompression" version="0"/>
				<attribute name="fused_names" value="data_mul_24444" version="0"/>
			</rt_info>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>3</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>3</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="27" name="data/norm/bn/mean/Fused_Mul_" type="Multiply" version="opset1">
			<data auto_broadcast="numpy"/>
			<rt_info>
				<attribute name="fused_names" value="data/norm/bn/mean/Fused_Mul_" version="0"/>
			</rt_info>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>3</dim>
					<dim>320</dim>
					<dim>544</dim>
				</port>
				<port id="1">
					<dim>1</dim>
					<dim>3</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>3</dim>
					<dim>320</dim>
					<dim>544</dim>
				</port>
			</output>
		</layer>
		<layer id="28" name="data_add_24446108924876" type="Const" version="opset1">
			<data element_type="f16" offset="54" shape="1,3,1,1" size="6"/>
			<output>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>3</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="29" name="data_add_24446108913918/restored_convert" type="Convert" version="opset1">
			<data destination_type="f32"/>
			<rt_info>
				<attribute name="decompression" version="0"/>
				<attribute name="fused_names" value="data_add_24446" version="0"/>
			</rt_info>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>3</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>3</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="30" name="data/norm/bn/variance/Fused_Add_" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<rt_info>
				<attribute name="fused_names" value="data/norm/bn/variance/Fused_Add_" version="0"/>
			</rt_info>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>3</dim>
					<dim>320</dim>
					<dim>544</dim>
				</port>
				<port id="1">
					<dim>1</dim>
					<dim>3</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" names="data/norm/bn" precision="FP32">
					<dim>1</dim>
					<dim>3</dim>
					<dim>320</dim>
					<dim>544</dim>
				</port>
			</output>
		</layer>
		<layer id="31" name="init_block1/dim_inc/conv/fq_input_0" type="FakeQuantize" version="opset1">
			<data auto_broadcast="numpy" levels="256"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>3</dim>
					<dim>320</dim>
					<dim>544</dim>
				</port>
				<port id="1"/>
				<port id="2"/>
				<port id="3"/>
				<port id="4"/>
			</input>
			<output>
				<port id="5" precision="FP32">
					<dim>1</dim>
					<dim>3</dim>
					<dim>320</dim>
					<dim>544</dim>
				</port>
			</output>
		</layer>
		<layer id="32" name="init_block1/dim_inc/bn/mean/Fused_Mul__copy109213919/restored_convert/quantized1690326934" type="Const" version="opset1">
			<data element_type="i8" offset="60" shape="32,3,3,3" size="864"/>
			<output>
				<port id="0" precision="I8">
					<dim>32</dim>
					<dim>3</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="33" name="init_block1/dim_inc/bn/mean/Fused_Mul__copy109213919/restored_convert/quantized/to_f32" type="Convert" version="opset1">
			<data destination_type="f32"/>
			<input>
				<port id="0">
					<dim>32</dim>
					<dim>3</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>32</dim>
					<dim>3</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="34" name="init_block1/dim_inc/conv/fq_weights_1/zero_point1692227438" type="Const" version="opset1">
			<data element_type="f32" offset="924" shape="32,1,1,1" size="128"/>
			<output>
				<port id="0" precision="FP32">
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="35" name="init_block1/dim_inc/conv/fq_weights_1/minus_zp" type="Subtract" version="opset1">
			<data auto_broadcast="numpy"/>
			<input>
				<port id="0">
					<dim>32</dim>
					<dim>3</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
				<port id="1">
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>32</dim>
					<dim>3</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="36" name="init_block1/dim_inc/conv/fq_weights_1/scale1691124972" type="Const" version="opset1">
			<data element_type="f32" offset="1052" shape="32,1,1,1" size="128"/>
			<output>
				<port id="0" precision="FP32">
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="37" name="init_block1/dim_inc/conv/fq_weights_1/mulpiply_by_scale" type="Multiply" version="opset1">
			<data auto_broadcast="numpy"/>
			<input>
				<port id="0">
					<dim>32</dim>
					<dim>3</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
				<port id="1">
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>32</dim>
					<dim>3</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="38" name="init_block1/dim_inc/conv" type="Convolution" version="opset1">
			<data auto_pad="explicit" dilations="1,1" pads_begin="1,1" pads_end="1,1" strides="2,2"/>
			<rt_info>
				<attribute name="fused_names" value="init_block1/dim_inc/conv" version="0"/>
			</rt_info>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>3</dim>
					<dim>320</dim>
					<dim>544</dim>
				</port>
				<port id="1">
					<dim>32</dim>
					<dim>3</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>160</dim>
					<dim>272</dim>
				</port>
			</output>
		</layer>
		<layer id="39" name="data_add_2444924454109527756" type="Const" version="opset1">
			<data element_type="f16" offset="1180" shape="1,32,1,1" size="64"/>
			<output>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="40" name="data_add_2444924454109513920/restored_convert" type="Convert" version="opset1">
			<data destination_type="f32"/>
			<rt_info>
				<attribute name="decompression" version="0"/>
				<attribute name="fused_names" value="data_add_2444924454" version="0"/>
			</rt_info>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="41" name="init_block1/dim_inc/bn/variance/Fused_Add_" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<rt_info>
				<attribute name="fused_names" value="init_block1/dim_inc/bn/variance/Fused_Add_" version="0"/>
			</rt_info>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>32</dim>
					<dim>160</dim>
					<dim>272</dim>
				</port>
				<port id="1">
					<dim>1</dim>
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" names="init_block1/dim_inc/conv" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>160</dim>
					<dim>272</dim>
				</port>
			</output>
		</layer>
		<layer id="42" name="init_block1/dim_inc/fn" type="ReLU" version="opset1">
			<rt_info>
				<attribute name="fused_names" value="init_block1/dim_inc/fn" version="0"/>
			</rt_info>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>32</dim>
					<dim>160</dim>
					<dim>272</dim>
				</port>
			</input>
			<output>
				<port id="1" names="init_block1/dim_inc/conv" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>160</dim>
					<dim>272</dim>
				</port>
			</output>
		</layer>
		<layer id="43" name="bottleneck1_1/add/fq_input_0" type="FakeQuantize" version="opset1">
			<data auto_broadcast="numpy" levels="256"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>32</dim>
					<dim>160</dim>
					<dim>272</dim>
				</port>
				<port id="1"/>
				<port id="2"/>
				<port id="3"/>
				<port id="4"/>
			</input>
			<output>
				<port id="5" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>160</dim>
					<dim>272</dim>
				</port>
			</output>
		</layer>
		<layer id="44" name="5827583127945" type="Const" version="opset1">
			<data element_type="f32" offset="1244" shape="" size="4"/>
			<output>
				<port id="0" precision="FP32"/>
			</output>
		</layer>
		<layer id="45" name="5828583227864" type="Const" version="opset1">
			<data element_type="f32" offset="1248" shape="" size="4"/>
			<output>
				<port id="0" precision="FP32"/>
			</output>
		</layer>
		<layer id="46" name="5829583327255" type="Const" version="opset1">
			<data element_type="f32" offset="1244" shape="" size="4"/>
			<output>
				<port id="0" precision="FP32"/>
			</output>
		</layer>
		<layer id="47" name="5830583427828" type="Const" version="opset1">
			<data element_type="f32" offset="1248" shape="" size="4"/>
			<output>
				<port id="0" precision="FP32"/>
			</output>
		</layer>
		<layer id="48" name="5157516127690" type="Const" version="opset1">
			<data element_type="f32" offset="1252" shape="" size="4"/>
			<output>
				<port id="0" precision="FP32"/>
			</output>
		</layer>
		<layer id="49" name="5158516227522" type="Const" version="opset1">
			<data element_type="f32" offset="1256" shape="" size="4"/>
			<output>
				<port id="0" precision="FP32"/>
			</output>
		</layer>
		<layer id="50" name="5159516325209" type="Const" version="opset1">
			<data element_type="f32" offset="1252" shape="" size="4"/>
			<output>
				<port id="0" precision="FP32"/>
			</output>
		</layer>
		<layer id="51" name="5160516424609" type="Const" version="opset1">
			<data element_type="f32" offset="1256" shape="" size="4"/>
			<output>
				<port id="0" precision="FP32"/>
			</output>
		</layer>
		<layer id="52" name="5517552125779" type="Const" version="opset1">
			<data element_type="f32" offset="1260" shape="1,8,1,1" size="32"/>
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>8</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="53" name="5518552224768" type="Const" version="opset1">
			<data element_type="f32" offset="1292" shape="1,8,1,1" size="32"/>
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>8</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="54" name="5519552327342" type="Const" version="opset1">
			<data element_type="f32" offset="1260" shape="1,8,1,1" size="32"/>
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>8</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="55" name="5520552427636" type="Const" version="opset1">
			<data element_type="f32" offset="1292" shape="1,8,1,1" size="32"/>
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>8</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="56" name="bottleneck1_1/dim_red/bn/mean/Fused_Mul__copy109913921/restored_convert/quantized1786325950" type="Const" version="opset1">
			<data element_type="i8" offset="1324" shape="8,32,1,1" size="256"/>
			<output>
				<port id="0" precision="I8">
					<dim>8</dim>
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="57" name="bottleneck1_1/dim_red/bn/mean/Fused_Mul__copy109913921/restored_convert/quantized/to_f32" type="Convert" version="opset1">
			<data destination_type="f32"/>
			<input>
				<port id="0">
					<dim>8</dim>
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>8</dim>
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="58" name="bottleneck1_1/dim_red/conv/fq_weights_1/zero_point1788227393" type="Const" version="opset1">
			<data element_type="f32" offset="1580" shape="8,1,1,1" size="32"/>
			<output>
				<port id="0" precision="FP32">
					<dim>8</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="59" name="bottleneck1_1/dim_red/conv/fq_weights_1/minus_zp" type="Subtract" version="opset1">
			<data auto_broadcast="numpy"/>
			<input>
				<port id="0">
					<dim>8</dim>
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
				<port id="1">
					<dim>8</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>8</dim>
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="60" name="bottleneck1_1/dim_red/conv/fq_weights_1/scale1787124894" type="Const" version="opset1">
			<data element_type="f32" offset="1612" shape="8,1,1,1" size="32"/>
			<output>
				<port id="0" precision="FP32">
					<dim>8</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="61" name="bottleneck1_1/dim_red/conv/fq_weights_1/mulpiply_by_scale" type="Multiply" version="opset1">
			<data auto_broadcast="numpy"/>
			<input>
				<port id="0">
					<dim>8</dim>
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
				<port id="1">
					<dim>8</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>8</dim>
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="62" name="bottleneck1_1/dim_red/conv" type="Convolution" version="opset1">
			<data auto_pad="explicit" dilations="1,1" pads_begin="0,0" pads_end="0,0" strides="1,1"/>
			<rt_info>
				<attribute name="fused_names" value="bottleneck1_1/dim_red/conv" version="0"/>
			</rt_info>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>32</dim>
					<dim>160</dim>
					<dim>272</dim>
				</port>
				<port id="1">
					<dim>8</dim>
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>8</dim>
					<dim>160</dim>
					<dim>272</dim>
				</port>
			</output>
		</layer>
		<layer id="63" name="data_add_2445724462110224741" type="Const" version="opset1">
			<data element_type="f16" offset="1644" shape="1,8,1,1" size="16"/>
			<output>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>8</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="64" name="data_add_2445724462110213922/restored_convert" type="Convert" version="opset1">
			<data destination_type="f32"/>
			<rt_info>
				<attribute name="decompression" version="0"/>
				<attribute name="fused_names" value="data_add_2445724462" version="0"/>
			</rt_info>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>8</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>8</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="65" name="bottleneck1_1/dim_red/bn/variance/Fused_Add_" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<rt_info>
				<attribute name="fused_names" value="bottleneck1_1/dim_red/bn/variance/Fused_Add_" version="0"/>
			</rt_info>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>8</dim>
					<dim>160</dim>
					<dim>272</dim>
				</port>
				<port id="1">
					<dim>1</dim>
					<dim>8</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" names="bottleneck1_1/dim_red/conv" precision="FP32">
					<dim>1</dim>
					<dim>8</dim>
					<dim>160</dim>
					<dim>272</dim>
				</port>
			</output>
		</layer>
		<layer id="66" name="bottleneck1_1/dim_red/fn/weights3126039782110526910" type="Const" version="opset1">
			<data element_type="f16" offset="1660" shape="1" size="2"/>
			<output>
				<port id="0" precision="FP16">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="67" name="bottleneck1_1/dim_red/fn/weights3126039782110513923/restored_convert" type="Convert" version="opset1">
			<data destination_type="f32"/>
			<rt_info>
				<attribute name="decompression" version="0"/>
				<attribute name="fused_names" value="bottleneck1_1/dim_red/fn/weights3126039782" version="0"/>
			</rt_info>
			<input>
				<port id="0">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="68" name="bottleneck1_1/dim_red/fn" type="PReLU" version="opset1">
			<rt_info>
				<attribute name="fused_names" value="bottleneck1_1/dim_red/fn" version="0"/>
			</rt_info>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>8</dim>
					<dim>160</dim>
					<dim>272</dim>
				</port>
				<port id="1">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" names="bottleneck1_1/dim_red/conv" precision="FP32">
					<dim>1</dim>
					<dim>8</dim>
					<dim>160</dim>
					<dim>272</dim>
				</port>
			</output>
		</layer>
		<layer id="69" name="bottleneck1_1/inner/dw1/conv/fq_input_0" type="FakeQuantize" version="opset1">
			<data auto_broadcast="numpy" levels="256"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>8</dim>
					<dim>160</dim>
					<dim>272</dim>
				</port>
				<port id="1">
					<dim>1</dim>
					<dim>8</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
				<port id="2">
					<dim>1</dim>
					<dim>8</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
				<port id="3">
					<dim>1</dim>
					<dim>8</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
				<port id="4">
					<dim>1</dim>
					<dim>8</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="5" precision="FP32">
					<dim>1</dim>
					<dim>8</dim>
					<dim>160</dim>
					<dim>272</dim>
				</port>
			</output>
		</layer>
		<layer id="70" name="21998/value2200024723" type="Const" version="opset1">
			<data element_type="i64" offset="1662" shape="5" size="40"/>
			<output>
				<port id="0" precision="I64">
					<dim>5</dim>
				</port>
			</output>
		</layer>
		<layer id="71" name="bottleneck1_1/inner/dw1/bn/mean/Fused_Mul__copy110813924/restored_convert/quantized1930327543" type="Const" version="opset1">
			<data element_type="i8" offset="1702" shape="8,1,3,3" size="72"/>
			<output>
				<port id="0" precision="I8">
					<dim>8</dim>
					<dim>1</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="72" name="bottleneck1_1/inner/dw1/bn/mean/Fused_Mul__copy110813924/restored_convert/quantized/to_f32" type="Convert" version="opset1">
			<data destination_type="f32"/>
			<input>
				<port id="0">
					<dim>8</dim>
					<dim>1</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>8</dim>
					<dim>1</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="73" name="bottleneck1_1/inner/dw1/conv/fq_weights_1/zero_point1932227762" type="Const" version="opset1">
			<data element_type="f32" offset="1774" shape="8,1,1,1" size="32"/>
			<output>
				<port id="0" precision="FP32">
					<dim>8</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="74" name="bottleneck1_1/inner/dw1/conv/fq_weights_1/minus_zp" type="Subtract" version="opset1">
			<data auto_broadcast="numpy"/>
			<input>
				<port id="0">
					<dim>8</dim>
					<dim>1</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
				<port id="1">
					<dim>8</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>8</dim>
					<dim>1</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="75" name="bottleneck1_1/inner/dw1/conv/fq_weights_1/scale1931125014" type="Const" version="opset1">
			<data element_type="f32" offset="1806" shape="8,1,1,1" size="32"/>
			<output>
				<port id="0" precision="FP32">
					<dim>8</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="76" name="bottleneck1_1/inner/dw1/conv/fq_weights_1/mulpiply_by_scale" type="Multiply" version="opset1">
			<data auto_broadcast="numpy"/>
			<input>
				<port id="0">
					<dim>8</dim>
					<dim>1</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
				<port id="1">
					<dim>8</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>8</dim>
					<dim>1</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="77" name="21998" type="Reshape" version="opset1">
			<data special_zero="true"/>
			<input>
				<port id="0">
					<dim>8</dim>
					<dim>1</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
				<port id="1">
					<dim>5</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>8</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="78" name="bottleneck1_1/inner/dw1/conv" type="GroupConvolution" version="opset1">
			<data auto_pad="explicit" dilations="1,1" pads_begin="1,1" pads_end="1,1" strides="1,1"/>
			<rt_info>
				<attribute name="fused_names" value="bottleneck1_1/inner/dw1/conv" version="0"/>
			</rt_info>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>8</dim>
					<dim>160</dim>
					<dim>272</dim>
				</port>
				<port id="1">
					<dim>8</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>8</dim>
					<dim>160</dim>
					<dim>272</dim>
				</port>
			</output>
		</layer>
		<layer id="79" name="data_add_2446524470111127318" type="Const" version="opset1">
			<data element_type="f16" offset="1838" shape="1,8,1,1" size="16"/>
			<output>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>8</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="80" name="data_add_2446524470111113925/restored_convert" type="Convert" version="opset1">
			<data destination_type="f32"/>
			<rt_info>
				<attribute name="decompression" version="0"/>
				<attribute name="fused_names" value="data_add_2446524470" version="0"/>
			</rt_info>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>8</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>8</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="81" name="bottleneck1_1/inner/dw1/bn/variance/Fused_Add_" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<rt_info>
				<attribute name="fused_names" value="bottleneck1_1/inner/dw1/bn/variance/Fused_Add_" version="0"/>
			</rt_info>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>8</dim>
					<dim>160</dim>
					<dim>272</dim>
				</port>
				<port id="1">
					<dim>1</dim>
					<dim>8</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" names="bottleneck1_1/inner/dw1/conv" precision="FP32">
					<dim>1</dim>
					<dim>8</dim>
					<dim>160</dim>
					<dim>272</dim>
				</port>
			</output>
		</layer>
		<layer id="82" name="bottleneck1_1/inner/dw1/fn/weights3089239548111426349" type="Const" version="opset1">
			<data element_type="f16" offset="1660" shape="1" size="2"/>
			<output>
				<port id="0" precision="FP16">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="83" name="bottleneck1_1/inner/dw1/fn/weights3089239548111413926/restored_convert" type="Convert" version="opset1">
			<data destination_type="f32"/>
			<rt_info>
				<attribute name="decompression" version="0"/>
				<attribute name="fused_names" value="bottleneck1_1/inner/dw1/fn/weights3089239548" version="0"/>
			</rt_info>
			<input>
				<port id="0">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="84" name="bottleneck1_1/inner/dw1/fn" type="PReLU" version="opset1">
			<rt_info>
				<attribute name="fused_names" value="bottleneck1_1/inner/dw1/fn" version="0"/>
			</rt_info>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>8</dim>
					<dim>160</dim>
					<dim>272</dim>
				</port>
				<port id="1">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" names="bottleneck1_1/inner/dw1/conv" precision="FP32">
					<dim>1</dim>
					<dim>8</dim>
					<dim>160</dim>
					<dim>272</dim>
				</port>
			</output>
		</layer>
		<layer id="85" name="bottleneck1_1/dim_inc/conv/fq_input_0" type="FakeQuantize" version="opset1">
			<data auto_broadcast="numpy" levels="256"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>8</dim>
					<dim>160</dim>
					<dim>272</dim>
				</port>
				<port id="1"/>
				<port id="2"/>
				<port id="3"/>
				<port id="4"/>
			</input>
			<output>
				<port id="5" precision="FP32">
					<dim>1</dim>
					<dim>8</dim>
					<dim>160</dim>
					<dim>272</dim>
				</port>
			</output>
		</layer>
		<layer id="86" name="bottleneck1_1/dim_inc/bn/mean/Fused_Mul__copy111713927/restored_convert/quantized1750326676" type="Const" version="opset1">
			<data element_type="i8" offset="1854" shape="32,8,1,1" size="256"/>
			<output>
				<port id="0" precision="I8">
					<dim>32</dim>
					<dim>8</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="87" name="bottleneck1_1/dim_inc/bn/mean/Fused_Mul__copy111713927/restored_convert/quantized/to_f32" type="Convert" version="opset1">
			<data destination_type="f32"/>
			<input>
				<port id="0">
					<dim>32</dim>
					<dim>8</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>32</dim>
					<dim>8</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="88" name="bottleneck1_1/dim_inc/conv/fq_weights_1/zero_point1752226286" type="Const" version="opset1">
			<data element_type="f32" offset="2110" shape="32,1,1,1" size="128"/>
			<output>
				<port id="0" precision="FP32">
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="89" name="bottleneck1_1/dim_inc/conv/fq_weights_1/minus_zp" type="Subtract" version="opset1">
			<data auto_broadcast="numpy"/>
			<input>
				<port id="0">
					<dim>32</dim>
					<dim>8</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
				<port id="1">
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>32</dim>
					<dim>8</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="90" name="bottleneck1_1/dim_inc/conv/fq_weights_1/scale1751127270" type="Const" version="opset1">
			<data element_type="f32" offset="2238" shape="32,1,1,1" size="128"/>
			<output>
				<port id="0" precision="FP32">
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="91" name="bottleneck1_1/dim_inc/conv/fq_weights_1/mulpiply_by_scale" type="Multiply" version="opset1">
			<data auto_broadcast="numpy"/>
			<input>
				<port id="0">
					<dim>32</dim>
					<dim>8</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
				<port id="1">
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>32</dim>
					<dim>8</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="92" name="bottleneck1_1/dim_inc/conv" type="Convolution" version="opset1">
			<data auto_pad="explicit" dilations="1,1" pads_begin="0,0" pads_end="0,0" strides="1,1"/>
			<rt_info>
				<attribute name="fused_names" value="bottleneck1_1/dim_inc/conv" version="0"/>
			</rt_info>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>8</dim>
					<dim>160</dim>
					<dim>272</dim>
				</port>
				<port id="1">
					<dim>32</dim>
					<dim>8</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>160</dim>
					<dim>272</dim>
				</port>
			</output>
		</layer>
		<layer id="93" name="data_add_2447324478112027978" type="Const" version="opset1">
			<data element_type="f16" offset="2366" shape="1,32,1,1" size="64"/>
			<output>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="94" name="data_add_2447324478112013928/restored_convert" type="Convert" version="opset1">
			<data destination_type="f32"/>
			<rt_info>
				<attribute name="decompression" version="0"/>
				<attribute name="fused_names" value="data_add_2447324478" version="0"/>
			</rt_info>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="95" name="bottleneck1_1/dim_inc/bn/variance/Fused_Add_" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<rt_info>
				<attribute name="fused_names" value="bottleneck1_1/dim_inc/bn/variance/Fused_Add_" version="0"/>
			</rt_info>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>32</dim>
					<dim>160</dim>
					<dim>272</dim>
				</port>
				<port id="1">
					<dim>1</dim>
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" names="bottleneck1_1/dim_inc/conv" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>160</dim>
					<dim>272</dim>
				</port>
			</output>
		</layer>
		<layer id="96" name="bottleneck1_1/add/fq_input_1" type="FakeQuantize" version="opset1">
			<data auto_broadcast="numpy" levels="256"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>32</dim>
					<dim>160</dim>
					<dim>272</dim>
				</port>
				<port id="1"/>
				<port id="2"/>
				<port id="3"/>
				<port id="4"/>
			</input>
			<output>
				<port id="5" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>160</dim>
					<dim>272</dim>
				</port>
			</output>
		</layer>
		<layer id="97" name="bottleneck1_1/add" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<rt_info>
				<attribute name="fused_names" value="bottleneck1_1/add" version="0"/>
			</rt_info>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>32</dim>
					<dim>160</dim>
					<dim>272</dim>
				</port>
				<port id="1">
					<dim>1</dim>
					<dim>32</dim>
					<dim>160</dim>
					<dim>272</dim>
				</port>
			</input>
			<output>
				<port id="2" names="bottleneck1_1/add" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>160</dim>
					<dim>272</dim>
				</port>
			</output>
		</layer>
		<layer id="98" name="bottleneck1_1/fn/weights3103240199112424960" type="Const" version="opset1">
			<data element_type="f16" offset="1660" shape="1" size="2"/>
			<output>
				<port id="0" precision="FP16">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="99" name="bottleneck1_1/fn/weights3103240199112413929/restored_convert" type="Convert" version="opset1">
			<data destination_type="f32"/>
			<rt_info>
				<attribute name="decompression" version="0"/>
				<attribute name="fused_names" value="bottleneck1_1/fn/weights3103240199" version="0"/>
			</rt_info>
			<input>
				<port id="0">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="100" name="bottleneck1_1/fn" type="PReLU" version="opset1">
			<rt_info>
				<attribute name="fused_names" value="bottleneck1_1/fn" version="0"/>
			</rt_info>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>32</dim>
					<dim>160</dim>
					<dim>272</dim>
				</port>
				<port id="1">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" names="bottleneck1_1/add" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>160</dim>
					<dim>272</dim>
				</port>
			</output>
		</layer>
		<layer id="101" name="bottleneck1_2/add/fq_input_0" type="FakeQuantize" version="opset1">
			<data auto_broadcast="numpy" levels="256"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>32</dim>
					<dim>160</dim>
					<dim>272</dim>
				</port>
				<port id="1"/>
				<port id="2"/>
				<port id="3"/>
				<port id="4"/>
			</input>
			<output>
				<port id="5" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>160</dim>
					<dim>272</dim>
				</port>
			</output>
		</layer>
		<layer id="102" name="4187419126883" type="Const" version="opset1">
			<data element_type="f32" offset="2430" shape="" size="4"/>
			<output>
				<port id="0" precision="FP32"/>
			</output>
		</layer>
		<layer id="103" name="4188419224687" type="Const" version="opset1">
			<data element_type="f32" offset="2434" shape="" size="4"/>
			<output>
				<port id="0" precision="FP32"/>
			</output>
		</layer>
		<layer id="104" name="4189419325758" type="Const" version="opset1">
			<data element_type="f32" offset="2430" shape="" size="4"/>
			<output>
				<port id="0" precision="FP32"/>
			</output>
		</layer>
		<layer id="105" name="4190419427750" type="Const" version="opset1">
			<data element_type="f32" offset="2434" shape="" size="4"/>
			<output>
				<port id="0" precision="FP32"/>
			</output>
		</layer>
		<layer id="106" name="5197520127774" type="Const" version="opset1">
			<data element_type="f32" offset="2438" shape="" size="4"/>
			<output>
				<port id="0" precision="FP32"/>
			</output>
		</layer>
		<layer id="107" name="5198520228014" type="Const" version="opset1">
			<data element_type="f32" offset="2442" shape="" size="4"/>
			<output>
				<port id="0" precision="FP32"/>
			</output>
		</layer>
		<layer id="108" name="5199520325146" type="Const" version="opset1">
			<data element_type="f32" offset="2438" shape="" size="4"/>
			<output>
				<port id="0" precision="FP32"/>
			</output>
		</layer>
		<layer id="109" name="5200520427711" type="Const" version="opset1">
			<data element_type="f32" offset="2442" shape="" size="4"/>
			<output>
				<port id="0" precision="FP32"/>
			</output>
		</layer>
		<layer id="110" name="4837484127177" type="Const" version="opset1">
			<data element_type="f32" offset="2446" shape="1,8,1,1" size="32"/>
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>8</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="111" name="4838484227822" type="Const" version="opset1">
			<data element_type="f32" offset="2478" shape="1,8,1,1" size="32"/>
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>8</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="112" name="4839484326814" type="Const" version="opset1">
			<data element_type="f32" offset="2446" shape="1,8,1,1" size="32"/>
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>8</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="113" name="4840484426481" type="Const" version="opset1">
			<data element_type="f32" offset="2478" shape="1,8,1,1" size="32"/>
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>8</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="114" name="bottleneck1_2/dim_red/bn/mean/Fused_Mul__copy112713930/restored_convert/quantized1696326601" type="Const" version="opset1">
			<data element_type="i8" offset="2510" shape="8,32,1,1" size="256"/>
			<output>
				<port id="0" precision="I8">
					<dim>8</dim>
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="115" name="bottleneck1_2/dim_red/bn/mean/Fused_Mul__copy112713930/restored_convert/quantized/to_f32" type="Convert" version="opset1">
			<data destination_type="f32"/>
			<input>
				<port id="0">
					<dim>8</dim>
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>8</dim>
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="116" name="bottleneck1_2/dim_red/conv/fq_weights_1/zero_point1698225152" type="Const" version="opset1">
			<data element_type="f32" offset="2766" shape="8,1,1,1" size="32"/>
			<output>
				<port id="0" precision="FP32">
					<dim>8</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="117" name="bottleneck1_2/dim_red/conv/fq_weights_1/minus_zp" type="Subtract" version="opset1">
			<data auto_broadcast="numpy"/>
			<input>
				<port id="0">
					<dim>8</dim>
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
				<port id="1">
					<dim>8</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>8</dim>
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="118" name="bottleneck1_2/dim_red/conv/fq_weights_1/scale1697126751" type="Const" version="opset1">
			<data element_type="f32" offset="2798" shape="8,1,1,1" size="32"/>
			<output>
				<port id="0" precision="FP32">
					<dim>8</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="119" name="bottleneck1_2/dim_red/conv/fq_weights_1/mulpiply_by_scale" type="Multiply" version="opset1">
			<data auto_broadcast="numpy"/>
			<input>
				<port id="0">
					<dim>8</dim>
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
				<port id="1">
					<dim>8</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>8</dim>
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="120" name="bottleneck1_2/dim_red/conv" type="Convolution" version="opset1">
			<data auto_pad="explicit" dilations="1,1" pads_begin="0,0" pads_end="0,0" strides="1,1"/>
			<rt_info>
				<attribute name="fused_names" value="bottleneck1_2/dim_red/conv" version="0"/>
			</rt_info>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>32</dim>
					<dim>160</dim>
					<dim>272</dim>
				</port>
				<port id="1">
					<dim>8</dim>
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>8</dim>
					<dim>160</dim>
					<dim>272</dim>
				</port>
			</output>
		</layer>
		<layer id="121" name="data_add_2448124486113027309" type="Const" version="opset1">
			<data element_type="f16" offset="2830" shape="1,8,1,1" size="16"/>
			<output>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>8</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="122" name="data_add_2448124486113013931/restored_convert" type="Convert" version="opset1">
			<data destination_type="f32"/>
			<rt_info>
				<attribute name="decompression" version="0"/>
				<attribute name="fused_names" value="data_add_2448124486" version="0"/>
			</rt_info>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>8</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>8</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="123" name="bottleneck1_2/dim_red/bn/variance/Fused_Add_" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<rt_info>
				<attribute name="fused_names" value="bottleneck1_2/dim_red/bn/variance/Fused_Add_" version="0"/>
			</rt_info>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>8</dim>
					<dim>160</dim>
					<dim>272</dim>
				</port>
				<port id="1">
					<dim>1</dim>
					<dim>8</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" names="bottleneck1_2/dim_red/conv" precision="FP32">
					<dim>1</dim>
					<dim>8</dim>
					<dim>160</dim>
					<dim>272</dim>
				</port>
			</output>
		</layer>
		<layer id="124" name="bottleneck1_2/dim_red/fn/weights3097640370113326829" type="Const" version="opset1">
			<data element_type="f16" offset="1660" shape="1" size="2"/>
			<output>
				<port id="0" precision="FP16">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="125" name="bottleneck1_2/dim_red/fn/weights3097640370113313932/restored_convert" type="Convert" version="opset1">
			<data destination_type="f32"/>
			<rt_info>
				<attribute name="decompression" version="0"/>
				<attribute name="fused_names" value="bottleneck1_2/dim_red/fn/weights3097640370" version="0"/>
			</rt_info>
			<input>
				<port id="0">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="126" name="bottleneck1_2/dim_red/fn" type="PReLU" version="opset1">
			<rt_info>
				<attribute name="fused_names" value="bottleneck1_2/dim_red/fn" version="0"/>
			</rt_info>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>8</dim>
					<dim>160</dim>
					<dim>272</dim>
				</port>
				<port id="1">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" names="bottleneck1_2/dim_red/conv" precision="FP32">
					<dim>1</dim>
					<dim>8</dim>
					<dim>160</dim>
					<dim>272</dim>
				</port>
			</output>
		</layer>
		<layer id="127" name="bottleneck1_2/inner/dw1/conv/fq_input_0" type="FakeQuantize" version="opset1">
			<data auto_broadcast="numpy" levels="256"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>8</dim>
					<dim>160</dim>
					<dim>272</dim>
				</port>
				<port id="1">
					<dim>1</dim>
					<dim>8</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
				<port id="2">
					<dim>1</dim>
					<dim>8</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
				<port id="3">
					<dim>1</dim>
					<dim>8</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
				<port id="4">
					<dim>1</dim>
					<dim>8</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="5" precision="FP32">
					<dim>1</dim>
					<dim>8</dim>
					<dim>160</dim>
					<dim>272</dim>
				</port>
			</output>
		</layer>
		<layer id="128" name="22002/value2200426856" type="Const" version="opset1">
			<data element_type="i64" offset="1662" shape="5" size="40"/>
			<output>
				<port id="0" precision="I64">
					<dim>5</dim>
				</port>
			</output>
		</layer>
		<layer id="129" name="bottleneck1_2/inner/dw1/bn/mean/Fused_Mul__copy113613933/restored_convert/quantized1660325341" type="Const" version="opset1">
