<?xml version="1.0" ?>
<net name="torch-jit-export" version="11">
	<layers>
		<layer id="136" name="input.1" type="Parameter" version="opset1">
			<data element_type="f32" shape="1,3,300,300"/>
			<rt_info>
				<attribute name="fused_names" value="input.1" version="0"/>
				<attribute name="old_api_map_element_type" value="f16" version="0"/>
			</rt_info>
			<output>
				<port id="0" names="input.1" precision="FP32">
					<dim>1</dim>
					<dim>3</dim>
					<dim>300</dim>
					<dim>300</dim>
					<rt_info>
						<attribute layout="[N,C,H,W]" name="layout" version="0"/>
					</rt_info>
				</port>
			</output>
		</layer>
		<layer id="0" name="1791179511494" type="Const" version="opset1">
			<data element_type="f32" offset="0" shape="" size="4"/>
			<output>
				<port id="0" precision="FP32"/>
			</output>
		</layer>
		<layer id="1" name="1792179611137" type="Const" version="opset1">
			<data element_type="f32" offset="4" shape="" size="4"/>
			<output>
				<port id="0" precision="FP32"/>
			</output>
		</layer>
		<layer id="2" name="1793179711398" type="Const" version="opset1">
			<data element_type="f32" offset="0" shape="" size="4"/>
			<output>
				<port id="0" precision="FP32"/>
			</output>
		</layer>
		<layer id="3" name="1794179811926" type="Const" version="opset1">
			<data element_type="f32" offset="4" shape="" size="4"/>
			<output>
				<port id="0" precision="FP32"/>
			</output>
		</layer>
		<layer id="4" name="2091209510621" type="Const" version="opset1">
			<data element_type="f32" offset="8" shape="1,360,1,1" size="1440"/>
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>360</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="5" name="2092209611599" type="Const" version="opset1">
			<data element_type="f32" offset="1448" shape="1,360,1,1" size="1440"/>
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>360</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="6" name="2093209711713" type="Const" version="opset1">
			<data element_type="f32" offset="8" shape="1,360,1,1" size="1440"/>
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>360</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="7" name="2094209810729" type="Const" version="opset1">
			<data element_type="f32" offset="1448" shape="1,360,1,1" size="1440"/>
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>360</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="8" name="2111211512046" type="Const" version="opset1">
			<data element_type="f32" offset="0" shape="" size="4"/>
			<output>
				<port id="0" precision="FP32"/>
			</output>
		</layer>
		<layer id="9" name="2112211610984" type="Const" version="opset1">
			<data element_type="f32" offset="2888" shape="" size="4"/>
			<output>
				<port id="0" precision="FP32"/>
			</output>
		</layer>
		<layer id="10" name="2113211710951" type="Const" version="opset1">
			<data element_type="f32" offset="0" shape="" size="4"/>
			<output>
				<port id="0" precision="FP32"/>
			</output>
		</layer>
		<layer id="11" name="2114211811623" type="Const" version="opset1">
			<data element_type="f32" offset="2888" shape="" size="4"/>
			<output>
				<port id="0" precision="FP32"/>
			</output>
		</layer>
		<layer id="12" name="2241224510786" type="Const" version="opset1">
			<data element_type="f32" offset="2892" shape="1,480,1,1" size="1920"/>
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>480</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="13" name="2242224612109" type="Const" version="opset1">
			<data element_type="f32" offset="4812" shape="1,480,1,1" size="1920"/>
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>480</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="14" name="2243224712019" type="Const" version="opset1">
			<data element_type="f32" offset="2892" shape="1,480,1,1" size="1920"/>
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>480</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="15" name="2244224810876" type="Const" version="opset1">
			<data element_type="f32" offset="4812" shape="1,480,1,1" size="1920"/>
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>480</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="16" name="2701270511359" type="Const" version="opset1">
			<data element_type="f32" offset="6732" shape="" size="4"/>
			<output>
				<port id="0" precision="FP32"/>
			</output>
		</layer>
		<layer id="17" name="2702270611095" type="Const" version="opset1">
			<data element_type="f32" offset="6736" shape="" size="4"/>
			<output>
				<port id="0" precision="FP32"/>
			</output>
		</layer>
		<layer id="18" name="2703270711380" type="Const" version="opset1">
			<data element_type="f32" offset="6732" shape="" size="4"/>
			<output>
				<port id="0" precision="FP32"/>
			</output>
		</layer>
		<layer id="19" name="2704270811527" type="Const" version="opset1">
			<data element_type="f32" offset="6736" shape="" size="4"/>
			<output>
				<port id="0" precision="FP32"/>
			</output>
		</layer>
		<layer id="20" name="1551155511530" type="Const" version="opset1">
			<data element_type="f32" offset="6740" shape="" size="4"/>
			<output>
				<port id="0" precision="FP32"/>
			</output>
		</layer>
		<layer id="21" name="1552155611302" type="Const" version="opset1">
			<data element_type="f32" offset="6744" shape="" size="4"/>
			<output>
				<port id="0" precision="FP32"/>
			</output>
		</layer>
		<layer id="22" name="1553155710732" type="Const" version="opset1">
			<data element_type="f32" offset="6740" shape="" size="4"/>
			<output>
				<port id="0" precision="FP32"/>
			</output>
		</layer>
		<layer id="23" name="1554155810936" type="Const" version="opset1">
			<data element_type="f32" offset="6744" shape="" size="4"/>
			<output>
				<port id="0" precision="FP32"/>
			</output>
		</layer>
		<layer id="24" name="2521252510903" type="Const" version="opset1">
			<data element_type="f32" offset="6748" shape="" size="4"/>
			<output>
				<port id="0" precision="FP32"/>
			</output>
		</layer>
		<layer id="25" name="2522252611395" type="Const" version="opset1">
			<data element_type="f32" offset="6752" shape="" size="4"/>
			<output>
				<port id="0" precision="FP32"/>
			</output>
		</layer>
		<layer id="26" name="2523252710927" type="Const" version="opset1">
			<data element_type="f32" offset="6748" shape="" size="4"/>
			<output>
				<port id="0" precision="FP32"/>
			</output>
		</layer>
		<layer id="27" name="2524252811842" type="Const" version="opset1">
			<data element_type="f32" offset="6752" shape="" size="4"/>
			<output>
				<port id="0" precision="FP32"/>
			</output>
		</layer>
		<layer id="28" name="1571157511161" type="Const" version="opset1">
			<data element_type="f32" offset="0" shape="" size="4"/>
			<output>
				<port id="0" precision="FP32"/>
			</output>
		</layer>
		<layer id="29" name="1572157611986" type="Const" version="opset1">
			<data element_type="f32" offset="6756" shape="" size="4"/>
			<output>
				<port id="0" precision="FP32"/>
			</output>
		</layer>
		<layer id="30" name="1573157712025" type="Const" version="opset1">
			<data element_type="f32" offset="0" shape="" size="4"/>
			<output>
				<port id="0" precision="FP32"/>
			</output>
		</layer>
		<layer id="31" name="1574157810591" type="Const" version="opset1">
			<data element_type="f32" offset="6756" shape="" size="4"/>
			<output>
				<port id="0" precision="FP32"/>
			</output>
		</layer>
		<layer id="32" name="2281228511881" type="Const" version="opset1">
			<data element_type="f32" offset="6760" shape="1,432,1,1" size="1728"/>
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>432</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="33" name="2282228611068" type="Const" version="opset1">
			<data element_type="f32" offset="8488" shape="1,432,1,1" size="1728"/>
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>432</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="34" name="2283228711440" type="Const" version="opset1">
			<data element_type="f32" offset="6760" shape="1,432,1,1" size="1728"/>
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>432</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="35" name="2284228810960" type="Const" version="opset1">
			<data element_type="f32" offset="8488" shape="1,432,1,1" size="1728"/>
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>432</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="36" name="2481248510921" type="Const" version="opset1">
			<data element_type="f32" offset="10216" shape="" size="4"/>
			<output>
				<port id="0" precision="FP32"/>
			</output>
		</layer>
		<layer id="37" name="2482248612022" type="Const" version="opset1">
			<data element_type="f32" offset="10220" shape="" size="4"/>
			<output>
				<port id="0" precision="FP32"/>
			</output>
		</layer>
		<layer id="38" name="2483248710690" type="Const" version="opset1">
			<data element_type="f32" offset="10216" shape="" size="4"/>
			<output>
				<port id="0" precision="FP32"/>
			</output>
		</layer>
		<layer id="39" name="2484248811950" type="Const" version="opset1">
			<data element_type="f32" offset="10220" shape="" size="4"/>
			<output>
				<port id="0" precision="FP32"/>
			</output>
		</layer>
		<layer id="40" name="1631163511719" type="Const" version="opset1">
			<data element_type="f32" offset="10224" shape="" size="4"/>
			<output>
				<port id="0" precision="FP32"/>
			</output>
		</layer>
		<layer id="41" name="1632163611809" type="Const" version="opset1">
			<data element_type="f32" offset="10228" shape="" size="4"/>
			<output>
				<port id="0" precision="FP32"/>
			</output>
		</layer>
		<layer id="42" name="1633163711035" type="Const" version="opset1">
			<data element_type="f32" offset="10224" shape="" size="4"/>
			<output>
				<port id="0" precision="FP32"/>
			</output>
		</layer>
		<layer id="43" name="1634163811725" type="Const" version="opset1">
			<data element_type="f32" offset="10228" shape="" size="4"/>
			<output>
				<port id="0" precision="FP32"/>
			</output>
		</layer>
		<layer id="44" name="1731173511581" type="Const" version="opset1">
			<data element_type="f32" offset="10232" shape="" size="4"/>
			<output>
				<port id="0" precision="FP32"/>
			</output>
		</layer>
		<layer id="45" name="1732173611149" type="Const" version="opset1">
			<data element_type="f32" offset="10236" shape="" size="4"/>
			<output>
				<port id="0" precision="FP32"/>
			</output>
		</layer>
		<layer id="46" name="1733173712043" type="Const" version="opset1">
			<data element_type="f32" offset="10232" shape="" size="4"/>
			<output>
				<port id="0" precision="FP32"/>
			</output>
		</layer>
		<layer id="47" name="1734173811002" type="Const" version="opset1">
			<data element_type="f32" offset="10236" shape="" size="4"/>
			<output>
				<port id="0" precision="FP32"/>
			</output>
		</layer>
		<layer id="48" name="2461246511716" type="Const" version="opset1">
			<data element_type="f32" offset="0" shape="" size="4"/>
			<output>
				<port id="0" precision="FP32"/>
			</output>
		</layer>
		<layer id="49" name="2462246612091" type="Const" version="opset1">
			<data element_type="f32" offset="10240" shape="" size="4"/>
			<output>
				<port id="0" precision="FP32"/>
			</output>
		</layer>
		<layer id="50" name="2463246711482" type="Const" version="opset1">
			<data element_type="f32" offset="0" shape="" size="4"/>
			<output>
				<port id="0" precision="FP32"/>
			</output>
		</layer>
		<layer id="51" name="2464246810888" type="Const" version="opset1">
			<data element_type="f32" offset="10240" shape="" size="4"/>
			<output>
				<port id="0" precision="FP32"/>
			</output>
		</layer>
		<layer id="52" name="2151215511656" type="Const" version="opset1">
			<data element_type="f32" offset="10244" shape="1,288,1,1" size="1152"/>
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>288</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="53" name="2152215610777" type="Const" version="opset1">
			<data element_type="f32" offset="11396" shape="1,288,1,1" size="1152"/>
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>288</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="54" name="2153215711671" type="Const" version="opset1">
			<data element_type="f32" offset="10244" shape="1,288,1,1" size="1152"/>
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>288</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="55" name="2154215811197" type="Const" version="opset1">
			<data element_type="f32" offset="11396" shape="1,288,1,1" size="1152"/>
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>288</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="56" name="1851185510735" type="Const" version="opset1">
			<data element_type="f32" offset="12548" shape="" size="4"/>
			<output>
				<port id="0" precision="FP32"/>
			</output>
		</layer>
		<layer id="57" name="1852185610579" type="Const" version="opset1">
			<data element_type="f32" offset="12552" shape="" size="4"/>
			<output>
				<port id="0" precision="FP32"/>
			</output>
		</layer>
		<layer id="58" name="1853185711608" type="Const" version="opset1">
			<data element_type="f32" offset="12548" shape="" size="4"/>
			<output>
				<port id="0" precision="FP32"/>
			</output>
		</layer>
		<layer id="59" name="1854185811038" type="Const" version="opset1">
			<data element_type="f32" offset="12552" shape="" size="4"/>
			<output>
				<port id="0" precision="FP32"/>
			</output>
		</layer>
		<layer id="60" name="1671167511410" type="Const" version="opset1">
			<data element_type="f32" offset="12556" shape="" size="4"/>
			<output>
				<port id="0" precision="FP32"/>
			</output>
		</layer>
		<layer id="61" name="1672167610696" type="Const" version="opset1">
			<data element_type="f32" offset="12560" shape="" size="4"/>
			<output>
				<port id="0" precision="FP32"/>
			</output>
		</layer>
		<layer id="62" name="1673167711332" type="Const" version="opset1">
			<data element_type="f32" offset="12556" shape="" size="4"/>
			<output>
				<port id="0" precision="FP32"/>
			</output>
		</layer>
		<layer id="63" name="1674167810765" type="Const" version="opset1">
			<data element_type="f32" offset="12560" shape="" size="4"/>
			<output>
				<port id="0" precision="FP32"/>
			</output>
		</layer>
		<layer id="64" name="1951195510975" type="Const" version="opset1">
			<data element_type="f32" offset="12564" shape="" size="4"/>
			<output>
				<port id="0" precision="FP32"/>
			</output>
		</layer>
		<layer id="65" name="1952195611503" type="Const" version="opset1">
			<data element_type="f32" offset="12568" shape="" size="4"/>
			<output>
				<port id="0" precision="FP32"/>
			</output>
		</layer>
		<layer id="66" name="1953195711191" type="Const" version="opset1">
			<data element_type="f32" offset="12564" shape="" size="4"/>
			<output>
				<port id="0" precision="FP32"/>
			</output>
		</layer>
		<layer id="67" name="1954195811827" type="Const" version="opset1">
			<data element_type="f32" offset="12568" shape="" size="4"/>
			<output>
				<port id="0" precision="FP32"/>
			</output>
		</layer>
		<layer id="68" name="1511151511041" type="Const" version="opset1">
			<data element_type="f32" offset="12572" shape="" size="4"/>
			<output>
				<port id="0" precision="FP32"/>
			</output>
		</layer>
		<layer id="69" name="1512151610873" type="Const" version="opset1">
			<data element_type="f32" offset="12576" shape="" size="4"/>
			<output>
				<port id="0" precision="FP32"/>
			</output>
		</layer>
		<layer id="70" name="1513151711278" type="Const" version="opset1">
			<data element_type="f32" offset="12572" shape="" size="4"/>
			<output>
				<port id="0" precision="FP32"/>
			</output>
		</layer>
		<layer id="71" name="1514151811806" type="Const" version="opset1">
			<data element_type="f32" offset="12576" shape="" size="4"/>
			<output>
				<port id="0" precision="FP32"/>
			</output>
		</layer>
		<layer id="72" name="1711171510945" type="Const" version="opset1">
			<data element_type="f32" offset="0" shape="" size="4"/>
			<output>
				<port id="0" precision="FP32"/>
			</output>
		</layer>
		<layer id="73" name="1712171611722" type="Const" version="opset1">
			<data element_type="f32" offset="12580" shape="" size="4"/>
			<output>
				<port id="0" precision="FP32"/>
			</output>
		</layer>
		<layer id="74" name="1713171711284" type="Const" version="opset1">
			<data element_type="f32" offset="0" shape="" size="4"/>
			<output>
				<port id="0" precision="FP32"/>
			</output>
		</layer>
		<layer id="75" name="1714171811695" type="Const" version="opset1">
			<data element_type="f32" offset="12580" shape="" size="4"/>
			<output>
				<port id="0" precision="FP32"/>
			</output>
		</layer>
		<layer id="76" name="1831183510648" type="Const" version="opset1">
			<data element_type="f32" offset="12584" shape="1,144,1,1" size="576"/>
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>144</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="77" name="1832183610606" type="Const" version="opset1">
			<data element_type="f32" offset="13160" shape="1,144,1,1" size="576"/>
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>144</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="78" name="1833183711761" type="Const" version="opset1">
			<data element_type="f32" offset="12584" shape="1,144,1,1" size="576"/>
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>144</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="79" name="1834183811392" type="Const" version="opset1">
			<data element_type="f32" offset="13160" shape="1,144,1,1" size="576"/>
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>144</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="80" name="2171217510792" type="Const" version="opset1">
			<data element_type="f32" offset="13736" shape="" size="4"/>
			<output>
				<port id="0" precision="FP32"/>
			</output>
		</layer>
		<layer id="81" name="2172217610852" type="Const" version="opset1">
			<data element_type="f32" offset="13740" shape="" size="4"/>
			<output>
				<port id="0" precision="FP32"/>
			</output>
		</layer>
		<layer id="82" name="2173217711782" type="Const" version="opset1">
			<data element_type="f32" offset="13736" shape="" size="4"/>
			<output>
				<port id="0" precision="FP32"/>
			</output>
		</layer>
		<layer id="83" name="2174217811086" type="Const" version="opset1">
			<data element_type="f32" offset="13740" shape="" size="4"/>
			<output>
				<port id="0" precision="FP32"/>
			</output>
		</layer>
		<layer id="84" name="1911191510972" type="Const" version="opset1">
			<data element_type="f32" offset="13744" shape="" size="4"/>
			<output>
				<port id="0" precision="FP32"/>
			</output>
		</layer>
		<layer id="85" name="1912191611764" type="Const" version="opset1">
			<data element_type="f32" offset="13748" shape="" size="4"/>
			<output>
				<port id="0" precision="FP32"/>
			</output>
		</layer>
		<layer id="86" name="1913191710861" type="Const" version="opset1">
			<data element_type="f32" offset="13744" shape="" size="4"/>
			<output>
				<port id="0" precision="FP32"/>
			</output>
		</layer>
		<layer id="87" name="1914191811221" type="Const" version="opset1">
			<data element_type="f32" offset="13748" shape="" size="4"/>
			<output>
				<port id="0" precision="FP32"/>
			</output>
		</layer>
		<layer id="88" name="1611161511638" type="Const" version="opset1">
			<data element_type="f32" offset="13752" shape="" size="4"/>
			<output>
				<port id="0" precision="FP32"/>
			</output>
		</layer>
		<layer id="89" name="1612161611464" type="Const" version="opset1">
			<data element_type="f32" offset="13756" shape="" size="4"/>
			<output>
				<port id="0" precision="FP32"/>
			</output>
		</layer>
		<layer id="90" name="1613161710597" type="Const" version="opset1">
			<data element_type="f32" offset="13752" shape="" size="4"/>
			<output>
				<port id="0" precision="FP32"/>
			</output>
		</layer>
		<layer id="91" name="1614161812082" type="Const" version="opset1">
			<data element_type="f32" offset="13756" shape="" size="4"/>
			<output>
				<port id="0" precision="FP32"/>
			</output>
		</layer>
		<layer id="92" name="1691169511785" type="Const" version="opset1">
			<data element_type="f32" offset="0" shape="" size="4"/>
			<output>
				<port id="0" precision="FP32"/>
			</output>
		</layer>
		<layer id="93" name="1692169610723" type="Const" version="opset1">
			<data element_type="f32" offset="13760" shape="" size="4"/>
			<output>
				<port id="0" precision="FP32"/>
			</output>
		</layer>
		<layer id="94" name="1693169710570" type="Const" version="opset1">
			<data element_type="f32" offset="0" shape="" size="4"/>
			<output>
				<port id="0" precision="FP32"/>
			</output>
		</layer>
		<layer id="95" name="1694169812052" type="Const" version="opset1">
			<data element_type="f32" offset="13760" shape="" size="4"/>
			<output>
				<port id="0" precision="FP32"/>
			</output>
		</layer>
		<layer id="96" name="2221222511662" type="Const" version="opset1">
			<data element_type="f32" offset="13764" shape="1,108,1,1" size="432"/>
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>108</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="97" name="2222222612013" type="Const" version="opset1">
			<data element_type="f32" offset="14196" shape="1,108,1,1" size="432"/>
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>108</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="98" name="2223222710885" type="Const" version="opset1">
			<data element_type="f32" offset="13764" shape="1,108,1,1" size="432"/>
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>108</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="99" name="2224222810813" type="Const" version="opset1">
			<data element_type="f32" offset="14196" shape="1,108,1,1" size="432"/>
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>108</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="100" name="1991199511908" type="Const" version="opset1">
			<data element_type="f32" offset="14628" shape="" size="4"/>
			<output>
				<port id="0" precision="FP32"/>
			</output>
		</layer>
		<layer id="101" name="1992199610783" type="Const" version="opset1">
			<data element_type="f32" offset="14632" shape="" size="4"/>
			<output>
				<port id="0" precision="FP32"/>
			</output>
		</layer>
		<layer id="102" name="1993199711077" type="Const" version="opset1">
			<data element_type="f32" offset="14628" shape="" size="4"/>
			<output>
				<port id="0" precision="FP32"/>
			</output>
		</layer>
		<layer id="103" name="1994199811017" type="Const" version="opset1">
			<data element_type="f32" offset="14632" shape="" size="4"/>
			<output>
				<port id="0" precision="FP32"/>
			</output>
		</layer>
		<layer id="104" name="2051205511887" type="Const" version="opset1">
			<data element_type="f32" offset="14636" shape="" size="4"/>
			<output>
				<port id="0" precision="FP32"/>
			</output>
		</layer>
		<layer id="105" name="2052205611584" type="Const" version="opset1">
			<data element_type="f32" offset="14640" shape="" size="4"/>
			<output>
				<port id="0" precision="FP32"/>
			</output>
		</layer>
		<layer id="106" name="2053205711749" type="Const" version="opset1">
			<data element_type="f32" offset="14636" shape="" size="4"/>
			<output>
				<port id="0" precision="FP32"/>
			</output>
		</layer>
		<layer id="107" name="2054205811737" type="Const" version="opset1">
			<data element_type="f32" offset="14640" shape="" size="4"/>
			<output>
				<port id="0" precision="FP32"/>
			</output>
		</layer>
		<layer id="108" name="2301230511797" type="Const" version="opset1">
			<data element_type="f32" offset="0" shape="" size="4"/>
			<output>
				<port id="0" precision="FP32"/>
			</output>
		</layer>
		<layer id="109" name="2302230611710" type="Const" version="opset1">
			<data element_type="f32" offset="14644" shape="" size="4"/>
			<output>
				<port id="0" precision="FP32"/>
			</output>
		</layer>
		<layer id="110" name="2303230711872" type="Const" version="opset1">
			<data element_type="f32" offset="0" shape="" size="4"/>
			<output>
				<port id="0" precision="FP32"/>
			</output>
		</layer>
		<layer id="111" name="2304230811356" type="Const" version="opset1">
			<data element_type="f32" offset="14644" shape="" size="4"/>
			<output>
				<port id="0" precision="FP32"/>
			</output>
		</layer>
		<layer id="112" name="2261226510741" type="Const" version="opset1">
			<data element_type="f32" offset="14648" shape="1,72,1,1" size="288"/>
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>72</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="113" name="2262226610987" type="Const" version="opset1">
			<data element_type="f32" offset="14936" shape="1,72,1,1" size="288"/>
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>72</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="114" name="2263226711836" type="Const" version="opset1">
			<data element_type="f32" offset="14648" shape="1,72,1,1" size="288"/>
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>72</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="115" name="2264226811743" type="Const" version="opset1">
			<data element_type="f32" offset="14936" shape="1,72,1,1" size="288"/>
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>72</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="116" name="1871187510816" type="Const" version="opset1">
			<data element_type="f32" offset="15224" shape="" size="4"/>
			<output>
				<port id="0" precision="FP32"/>
			</output>
		</layer>
		<layer id="117" name="1872187610726" type="Const" version="opset1">
			<data element_type="f32" offset="15228" shape="" size="4"/>
			<output>
				<port id="0" precision="FP32"/>
			</output>
		</layer>
		<layer id="118" name="1873187711896" type="Const" version="opset1">
			<data element_type="f32" offset="15224" shape="" size="4"/>
			<output>
				<port id="0" precision="FP32"/>
			</output>
		</layer>
		<layer id="119" name="1874187811026" type="Const" version="opset1">
			<data element_type="f32" offset="15228" shape="" size="4"/>
			<output>
				<port id="0" precision="FP32"/>
			</output>
		</layer>
		<layer id="120" name="2401240511281" type="Const" version="opset1">
			<data element_type="f32" offset="0" shape="" size="4"/>
			<output>
				<port id="0" precision="FP32"/>
			</output>
		</layer>
		<layer id="121" name="2402240611611" type="Const" version="opset1">
			<data element_type="f32" offset="15232" shape="" size="4"/>
			<output>
				<port id="0" precision="FP32"/>
			</output>
		</layer>
		<layer id="122" name="2403240712106" type="Const" version="opset1">
			<data element_type="f32" offset="0" shape="" size="4"/>
			<output>
				<port id="0" precision="FP32"/>
			</output>
		</layer>
		<layer id="123" name="2404240811779" type="Const" version="opset1">
			<data element_type="f32" offset="15232" shape="" size="4"/>
			<output>
				<port id="0" precision="FP32"/>
			</output>
		</layer>
		<layer id="124" name="1751175511512" type="Const" version="opset1">
			<data element_type="f32" offset="15236" shape="1,24,1,1" size="96"/>
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>24</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="125" name="1752175611902" type="Const" version="opset1">
			<data element_type="f32" offset="15332" shape="1,24,1,1" size="96"/>
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>24</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="126" name="1753175710807" type="Const" version="opset1">
			<data element_type="f32" offset="15236" shape="1,24,1,1" size="96"/>
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>24</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="127" name="1754175811188" type="Const" version="opset1">
			<data element_type="f32" offset="15332" shape="1,24,1,1" size="96"/>
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>24</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="128" name="2341234511461" type="Const" version="opset1">
			<data element_type="f32" offset="15428" shape="" size="4"/>
			<output>
				<port id="0" precision="FP32"/>
			</output>
		</layer>
		<layer id="129" name="2342234610639" type="Const" version="opset1">
			<data element_type="f32" offset="15432" shape="" size="4"/>
			<output>
				<port id="0" precision="FP32"/>
			</output>
		</layer>
		<layer id="130" name="2343234710558" type="Const" version="opset1">
			<data element_type="f32" offset="15428" shape="" size="4"/>
			<output>
				<port id="0" precision="FP32"/>
			</output>
		</layer>
		<layer id="131" name="2344234811236" type="Const" version="opset1">
			<data element_type="f32" offset="15432" shape="" size="4"/>
			<output>
				<port id="0" precision="FP32"/>
			</output>
		</layer>
		<layer id="132" name="2211221511524" type="Const" version="opset1">
			<data element_type="f32" offset="0" shape="" size="4"/>
			<output>
				<port id="0" precision="FP32"/>
			</output>
		</layer>
		<layer id="133" name="2212221611518" type="Const" version="opset1">
			<data element_type="f32" offset="15436" shape="" size="4"/>
			<output>
				<port id="0" precision="FP32"/>
			</output>
		</layer>
		<layer id="134" name="2213221711587" type="Const" version="opset1">
			<data element_type="f32" offset="0" shape="" size="4"/>
			<output>
				<port id="0" precision="FP32"/>
			</output>
		</layer>
		<layer id="135" name="2214221810687" type="Const" version="opset1">
			<data element_type="f32" offset="15436" shape="" size="4"/>
			<output>
				<port id="0" precision="FP32"/>
			</output>
		</layer>
		<layer id="137" name="Constant_1385443811230" type="Const" version="opset1">
			<data element_type="f16" offset="15440" shape="1,1,1,1" size="2"/>
			<output>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="138" name="Constant_138544385883/restored_convert" type="Convert" version="opset1">
			<data destination_type="f32"/>
			<rt_info>
				<attribute name="decompression" version="0"/>
			</rt_info>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="139" name="Divide_2404" type="Multiply" version="opset1">
			<data auto_broadcast="numpy"/>
			<rt_info>
				<attribute name="fused_names" value="Constant_2403, Divide_2404" version="0"/>
				<attribute name="preprocessing" version="0"/>
			</rt_info>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>3</dim>
					<dim>300</dim>
					<dim>300</dim>
				</port>
				<port id="1">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>3</dim>
					<dim>300</dim>
					<dim>300</dim>
				</port>
			</output>
		</layer>
		<layer id="140" name="Multiply_12614/fq_input_0" type="FakeQuantize" version="opset1">
			<data auto_broadcast="numpy" levels="256"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>3</dim>
					<dim>300</dim>
					<dim>300</dim>
				</port>
				<port id="1"/>
				<port id="2"/>
				<port id="3"/>
				<port id="4"/>
			</input>
			<output>
				<port id="5" precision="FP32">
					<dim>1</dim>
					<dim>3</dim>
					<dim>300</dim>
					<dim>300</dim>
				</port>
			</output>
		</layer>
		<layer id="141" name="Gather_1384744111212" type="Const" version="opset1">
			<data element_type="f16" offset="15442" shape="1,3,1,1" size="6"/>
			<output>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>3</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="142" name="Gather_138474415884/restored_convert" type="Convert" version="opset1">
			<data destination_type="f32"/>
			<rt_info>
				<attribute name="decompression" version="0"/>
			</rt_info>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>3</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>3</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="143" name="Multiply_12614" type="Multiply" version="opset1">
			<data auto_broadcast="numpy"/>
			<rt_info>
				<attribute name="fused_names" value="331, backbone.bn_first.bias, backbone.bn_first.running_mean, backbone.bn_first.running_var, backbone.bn_first.weight" version="0"/>
			</rt_info>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>3</dim>
					<dim>300</dim>
					<dim>300</dim>
				</port>
				<port id="1">
					<dim>1</dim>
					<dim>3</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>3</dim>
					<dim>300</dim>
					<dim>300</dim>
				</port>
			</output>
		</layer>
		<layer id="144" name="Gather_1385044410804" type="Const" version="opset1">
			<data element_type="f16" offset="15448" shape="1,3,1,1" size="6"/>
			<output>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>3</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="145" name="Gather_138504445885/restored_convert" type="Convert" version="opset1">
			<data destination_type="f32"/>
			<rt_info>
				<attribute name="decompression" version="0"/>
			</rt_info>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>3</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>3</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="146" name="331" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<rt_info>
				<attribute name="fused_names" value="331, backbone.bn_first.bias, backbone.bn_first.running_mean, backbone.bn_first.running_var, backbone.bn_first.weight" version="0"/>
			</rt_info>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>3</dim>
					<dim>300</dim>
					<dim>300</dim>
				</port>
				<port id="1">
					<dim>1</dim>
					<dim>3</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" names="331" precision="FP32">
					<dim>1</dim>
					<dim>3</dim>
					<dim>300</dim>
					<dim>300</dim>
				</port>
			</output>
		</layer>
		<layer id="147" name="Multiply_12621/fq_input_0" type="FakeQuantize" version="opset1">
			<data auto_broadcast="numpy" levels="256"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>3</dim>
					<dim>300</dim>
					<dim>300</dim>
				</port>
				<port id="1"/>
				<port id="2"/>
				<port id="3"/>
				<port id="4"/>
			</input>
			<output>
				<port id="5" precision="FP32">
					<dim>1</dim>
					<dim>3</dim>
					<dim>300</dim>
					<dim>300</dim>
				</port>
			</output>
		</layer>
		<layer id="148" name="Gather_138534475886/restored_convert/quantized769111992" type="Const" version="opset1">
			<data element_type="i8" offset="15454" shape="24,3,3,3" size="648"/>
			<output>
				<port id="0" precision="I8">
					<dim>24</dim>
					<dim>3</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="149" name="Gather_138534475886/restored_convert/quantized/to_f32" type="Convert" version="opset1">
			<data destination_type="f32"/>
			<input>
				<port id="0">
					<dim>24</dim>
					<dim>3</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>24</dim>
					<dim>3</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="150" name="Multiply_12621/fq_weights_1/zero_point771011365" type="Const" version="opset1">
			<data element_type="f32" offset="16102" shape="24,1,1,1" size="96"/>
			<output>
				<port id="0" precision="FP32">
					<dim>24</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="151" name="Multiply_12621/fq_weights_1/minus_zp" type="Subtract" version="opset1">
			<data auto_broadcast="numpy"/>
			<input>
				<port id="0">
					<dim>24</dim>
					<dim>3</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
				<port id="1">
					<dim>24</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>24</dim>
					<dim>3</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="152" name="Multiply_12621/fq_weights_1/scale769911590" type="Const" version="opset1">
			<data element_type="f32" offset="16198" shape="24,1,1,1" size="96"/>
			<output>
				<port id="0" precision="FP32">
					<dim>24</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="153" name="Multiply_12621/fq_weights_1/mulpiply_by_scale" type="Multiply" version="opset1">
			<data auto_broadcast="numpy"/>
			<input>
				<port id="0">
					<dim>24</dim>
					<dim>3</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
				<port id="1">
					<dim>24</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>24</dim>
					<dim>3</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="154" name="Multiply_12621" type="Convolution" version="opset1">
			<data auto_pad="explicit" dilations="1,1" pads_begin="1,1" pads_end="1,1" strides="2,2"/>
			<rt_info>
				<attribute name="fused_names" value="332, 333, backbone.features.0.1.bias, backbone.features.0.1.running_mean, backbone.features.0.1.running_var, backbone.features.0.1.weight" version="0"/>
			</rt_info>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>3</dim>
					<dim>300</dim>
					<dim>300</dim>
				</port>
				<port id="1">
					<dim>24</dim>
					<dim>3</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>24</dim>
					<dim>150</dim>
					<dim>150</dim>
				</port>
			</output>
		</layer>
		<layer id="155" name="Constant_1262645011260" type="Const" version="opset1">
			<data element_type="f16" offset="16294" shape="1,24,1,1" size="48"/>
			<output>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>24</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="156" name="Constant_126264505887/restored_convert" type="Convert" version="opset1">
			<data destination_type="f32"/>
			<rt_info>
				<attribute name="decompression" version="0"/>
			</rt_info>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>24</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>24</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="157" name="333" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<rt_info>
				<attribute name="fused_names" value="333, backbone.features.0.1.bias, backbone.features.0.1.running_mean, backbone.features.0.1.running_var, backbone.features.0.1.weight" version="0"/>
			</rt_info>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>24</dim>
					<dim>150</dim>
					<dim>150</dim>
				</port>
				<port id="1">
					<dim>1</dim>
					<dim>24</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" names="333" precision="FP32">
					<dim>1</dim>
					<dim>24</dim>
					<dim>150</dim>
					<dim>150</dim>
				</port>
			</output>
		</layer>
		<layer id="158" name="334" type="ReLU" version="opset1">
			<rt_info>
				<attribute name="fused_names" value="334" version="0"/>
			</rt_info>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>24</dim>
					<dim>150</dim>
					<dim>150</dim>
				</port>
			</input>
			<output>
				<port id="1" names="334" precision="FP32">
					<dim>1</dim>
					<dim>24</dim>
					<dim>150</dim>
					<dim>150</dim>
				</port>
			</output>
		</layer>
		<layer id="159" name="Multiply_12628/fq_input_0" type="FakeQuantize" version="opset1">
			<data auto_broadcast="numpy" levels="256"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>24</dim>
					<dim>150</dim>
					<dim>150</dim>
				</port>
				<port id="1">
					<dim>1</dim>
					<dim>24</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
				<port id="2">
					<dim>1</dim>
					<dim>24</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
				<port id="3">
					<dim>1</dim>
					<dim>24</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
				<port id="4">
					<dim>1</dim>
					<dim>24</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="5" precision="FP32">
					<dim>1</dim>
					<dim>24</dim>
					<dim>150</dim>
					<dim>150</dim>
				</port>
			</output>
		</layer>
		<layer id="160" name="9416/value941811758" type="Const" version="opset1">
			<data element_type="i64" offset="16342" shape="5" size="40"/>
			<output>
				<port id="0" precision="I64">
					<dim>5</dim>
				</port>
			</output>
		</layer>
		<layer id="161" name="Multiply_130144545888/restored_convert/quantized724110846" type="Const" version="opset1">
			<data element_type="i8" offset="16382" shape="24,1,3,3" size="216"/>
			<output>
				<port id="0" precision="I8">
					<dim>24</dim>
					<dim>1</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="162" name="Multiply_130144545888/restored_convert/quantized/to_f32" type="Convert" version="opset1">
			<data destination_type="f32"/>
			<input>
				<port id="0">
					<dim>24</dim>
					<dim>1</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>24</dim>
					<dim>1</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="163" name="Multiply_12628/fq_weights_1/zero_point726010555" type="Const" version="opset1">
			<data element_type="f32" offset="16598" shape="24,1,1,1" size="96"/>
			<output>
				<port id="0" precision="FP32">
					<dim>24</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="164" name="Multiply_12628/fq_weights_1/minus_zp" type="Subtract" version="opset1">
			<data auto_broadcast="numpy"/>
			<input>
				<port id="0">
					<dim>24</dim>
					<dim>1</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
				<port id="1">
					<dim>24</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>24</dim>
					<dim>1</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="165" name="Multiply_12628/fq_weights_1/scale724911251" type="Const" version="opset1">
			<data element_type="f32" offset="16694" shape="24,1,1,1" size="96"/>
			<output>
				<port id="0" precision="FP32">
					<dim>24</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="166" name="Multiply_12628/fq_weights_1/mulpiply_by_scale" type="Multiply" version="opset1">
			<data auto_broadcast="numpy"/>
			<input>
				<port id="0">
					<dim>24</dim>
					<dim>1</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
				<port id="1">
					<dim>24</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>24</dim>
					<dim>1</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="167" name="9416" type="Reshape" version="opset1">
			<data special_zero="true"/>
			<input>
				<port id="0">
					<dim>24</dim>
					<dim>1</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
				<port id="1">
					<dim>5</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>24</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="168" name="Multiply_12628" type="GroupConvolution" version="opset1">
			<data auto_pad="explicit" dilations="1,1" pads_begin="1,1" pads_end="1,1" strides="1,1"/>
			<rt_info>
				<attribute name="fused_names" value="336, backbone.features.1.conv.1.bias, backbone.features.1.conv.1.running_mean, backbone.features.1.conv.1.running_var, backbone.features.1.conv.1.weight" version="0"/>
			</rt_info>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>24</dim>
					<dim>150</dim>
					<dim>150</dim>
				</port>
				<port id="1">
					<dim>24</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" names="335" precision="FP32">
					<dim>1</dim>
					<dim>24</dim>
					<dim>150</dim>
					<dim>150</dim>
				</port>
			</output>
		</layer>
		<layer id="169" name="Constant_1263345711509" type="Const" version="opset1">
			<data element_type="f16" offset="16790" shape="1,24,1,1" size="48"/>
			<output>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>24</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="170" name="Constant_126334575889/restored_convert" type="Convert" version="opset1">
			<data destination_type="f32"/>
			<rt_info>
				<attribute name="decompression" version="0"/>
			</rt_info>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>24</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>24</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="171" name="336" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<rt_info>
				<attribute name="fused_names" value="336, backbone.features.1.conv.1.bias, backbone.features.1.conv.1.running_mean, backbone.features.1.conv.1.running_var, backbone.features.1.conv.1.weight" version="0"/>
			</rt_info>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>24</dim>
					<dim>150</dim>
					<dim>150</dim>
				</port>
				<port id="1">
					<dim>1</dim>
					<dim>24</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" names="336" precision="FP32">
					<dim>1</dim>
					<dim>24</dim>
					<dim>150</dim>
					<dim>150</dim>
				</port>
			</output>
		</layer>
		<layer id="172" name="337" type="ReLU" version="opset1">
			<rt_info>
				<attribute name="fused_names" value="337" version="0"/>
			</rt_info>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>24</dim>
					<dim>150</dim>
					<dim>150</dim>
				</port>
			</input>
			<output>
				<port id="1" names="337" precision="FP32">
					<dim>1</dim>
					<dim>24</dim>
					<dim>150</dim>
					<dim>150</dim>
				</port>
			</output>
		</layer>
		<layer id="173" name="Multiply_12635/fq_input_0" type="FakeQuantize" version="opset1">
			<data auto_broadcast="numpy" levels="256"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>24</dim>
					<dim>150</dim>
					<dim>150</dim>
				</port>
				<port id="1"/>
				<port id="2"/>
				<port id="3"/>
				<port id="4"/>
			</input>
			<output>
				<port id="5" precision="FP32">
					<dim>1</dim>
					<dim>24</dim>
					<dim>150</dim>
					<dim>150</dim>
				</port>
			</output>
		</layer>
		<layer id="174" name="Multiply_130224615890/restored_convert/quantized832112058" type="Const" version="opset1">
			<data element_type="i8" offset="16838" shape="12,24,1,1" size="288"/>
			<output>
				<port id="0" precision="I8">
					<dim>12</dim>
					<dim>24</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="175" name="Multiply_130224615890/restored_convert/quantized/to_f32" type="Convert" version="opset1">
			<data destination_type="f32"/>
			<input>
				<port id="0">
					<dim>12</dim>
					<dim>24</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>12</dim>
					<dim>24</dim>
					<dim>1</dim>
